; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-8-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-2 - location
	p1-5 - location
	p3-0 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	p4-2 - location
	p5-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s2)
	(at driver4 s3)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s3)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s1)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s4)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s0)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s5)
	(at package2 s4)
	(at package3 s2)
	(at package4 s3)
	(at package5 s2)
	(at package6 s4)
	(at package7 s4)
	(at package8 s4)
	(at package9 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 81)
	(= (time-to-drive s3 s0) 81)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 34)
	(= (time-to-drive s4 s0) 34)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 8)
	(= (time-to-drive s2 s1) 8)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 62)
	(= (time-to-drive s5 s1) 62)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 14)
	(= (time-to-drive s0 s2) 14)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 78)
	(= (time-to-drive s3 s2) 78)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 31)
	(= (time-to-drive s1 s3) 31)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 53)
	(= (time-to-drive s1 s4) 53)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 53)
	(= (time-to-drive s2 s4) 53)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 12)
	(= (time-to-drive s3 s4) 12)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 26)
	(= (time-to-drive s5 s4) 26)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 83)
	(= (time-to-drive s2 s5) 83)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 65)
	(= (time-to-drive s3 s5) 65)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s5)
	(at driver4 s4)
	(at truck2 s0)
	(at truck3 s4)
	(at truck4 s1)
	(at truck6 s3)
	(at package1 s1)
	(at package2 s5)
	(at package3 s1)
	(at package4 s0)
	(at package5 s3)
	(at package6 s4)
	(at package7 s2)
	(at package8 s4)
	(at package9 s2)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver4 s3 p3-4)
   deleted: (at driver4 s3)
   added: (at driver4 p3-4)
   goals met: 5 of 17
2. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 5 of 17
3. (load-truck package1 truck2 s5)
   deleted: (at package1 s5)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 17
4. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 17
5. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 5 of 17
6. (walk driver4 p3-4 s4)
   deleted: (at driver4 p3-4)
   added: (at driver4 s4)
   goals met: 6 of 17
7. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 0 to 104
   goals met: 6 of 17
8. (unload-truck package3 truck3 s1)
   deleted: (in package3 truck3)
   added: (at package3 s1)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 7 of 17
9. (drive-truck truck3 s1 s4 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 104 to 687
   goals met: 8 of 17
10. (load-truck package2 truck3 s4)
   deleted: (at package2 s4)
   added: (in package2 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 8 of 17
11. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 17
12. (drive-truck truck2 s5 s3 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   changed: (fuel-used) from 687 to 1402
   goals met: 7 of 17
13. (load-truck package9 truck2 s3)
   deleted: (at package9 s3)
   added: (in package9 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 7 of 17
14. (load-truck package7 truck3 s4)
   deleted: (at package7 s4)
   added: (in package7 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 7 of 17
15. (load-truck package4 truck2 s3)
   deleted: (at package4 s3)
   added: (in package4 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 7 of 17
16. (drive-truck truck2 s3 s2 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 1402 to 2650
   goals met: 7 of 17
17. (unload-truck package9 truck2 s2)
   deleted: (in package9 truck2)
   added: (at package9 s2)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 8 of 17
18. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 2650 to 2754
   goals met: 8 of 17
19. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 9 of 17
20. (drive-truck truck3 s4 s2 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (fuel-used) from 2754 to 3602
   goals met: 8 of 17
21. (unload-truck package7 truck3 s2)
   deleted: (in package7 truck3)
   added: (at package7 s2)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 9 of 17
22. (drive-truck truck3 s2 s5 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (fuel-used) from 3602 to 4681
   goals met: 9 of 17
23. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 4681 to 5022
   goals met: 9 of 17
24. (unload-truck package2 truck3 s5)
   deleted: (in package2 truck3)
   added: (at package2 s5)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 10 of 17
25. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 5022 to 5913
   goals met: 11 of 17
26. (unload-truck package4 truck2 s0)
   deleted: (in package4 truck2)
   added: (at package4 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 12 of 17
27. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 5913 to 6723
   goals met: 11 of 17
28. (drive-truck truck3 s5 s3 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (fuel-used) from 6723 to 7438
   goals met: 11 of 17
29. (unload-truck package5 truck3 s3)
   deleted: (in package5 truck3)
   added: (at package5 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 12 of 17
30. (drive-truck truck3 s3 s5 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (fuel-used) from 7438 to 8088
   goals met: 12 of 17
31. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 13 of 17
32. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 8088 to 8898
   goals met: 14 of 17
33. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 13 of 17
34. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 13 of 17
35. (board-truck driver1 truck6 s1)
   deleted: (at driver1 s1) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 13 of 17
36. (drive-truck truck6 s1 s2 driver1)
   deleted: (at truck6 s1)
   added: (at truck6 s2)
   changed: (fuel-used) from 8898 to 8978
   goals met: 13 of 17
37. (drive-truck truck2 s0 s4 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 8978 to 9318
   goals met: 12 of 17
38. (drive-truck truck2 s4 s5 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (fuel-used) from 9318 to 9578
   goals met: 12 of 17
39. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 13 of 17
40. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 12 of 17
41. (drive-truck truck2 s5 s4 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 9578 to 9838
   goals met: 12 of 17
42. (drive-truck truck2 s4 s0 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 9838 to 10178
   goals met: 13 of 17
43. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 12 of 17
44. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 12 of 17
45. (drive-truck truck3 s5 s4 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 10178 to 10438
   goals met: 13 of 17
46. (drive-truck truck6 s2 s3 driver1)
   deleted: (at truck6 s2)
   added: (at truck6 s3)
   changed: (fuel-used) from 10438 to 11218
   goals met: 14 of 17
47. (disembark-truck driver1 truck6 s3)
   deleted: (driving driver1 truck6)
   added: (at driver1 s3) (empty truck6)
   goals met: 14 of 17
48. (walk driver1 s3 p3-2)
   deleted: (at driver1 s3)
   added: (at driver1 p3-2)
   goals met: 14 of 17
49. (drive-truck truck3 s4 s5 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 11218 to 11478
   goals met: 13 of 17
50. (disembark-truck driver2 truck3 s5)
   deleted: (driving driver2 truck3)
   added: (at driver2 s5) (empty truck3)
   goals met: 14 of 17
51. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 14 of 17
52. (walk driver1 p3-2 s2)
   deleted: (at driver1 p3-2)
   added: (at driver1 s2)
   goals met: 15 of 17
53. (drive-truck truck2 s0 s3 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 11478 to 12288
   goals met: 14 of 17
54. (drive-truck truck2 s3 s5 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 12288 to 12938
   goals met: 14 of 17
55. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 15 of 17
56. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 14 of 17
57. (drive-truck truck2 s5 s3 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   changed: (fuel-used) from 12938 to 13588
   goals met: 14 of 17
58. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 13588 to 14398
   goals met: 15 of 17
59. (board-truck driver3 truck3 s5)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 14 of 17
60. (drive-truck truck3 s5 s4 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 14398 to 14658
   goals met: 15 of 17
61. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 15 of 17
62. (drive-truck truck3 s4 s5 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 14658 to 14918
   goals met: 14 of 17
63. (walk driver2 s0 p3-0)
   deleted: (at driver2 s0)
   added: (at driver2 p3-0)
   goals met: 14 of 17
64. (drive-truck truck3 s5 s4 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 14918 to 15178
   goals met: 15 of 17
65. (disembark-truck driver3 truck3 s4)
   deleted: (driving driver3 truck3)
   added: (at driver3 s4) (empty truck3)
   goals met: 15 of 17
66. (walk driver2 p3-0 s3)
   deleted: (at driver2 p3-0)
   added: (at driver2 s3)
   goals met: 15 of 17
67. (walk driver2 s3 p5-3)
   deleted: (at driver2 s3)
   added: (at driver2 p5-3)
   goals met: 15 of 17
68. (walk driver2 p5-3 s5)
   deleted: (at driver2 p5-3)
   added: (at driver2 s5)
   goals met: 16 of 17
69. (board-truck driver3 truck7 s4)
   deleted: (at driver3 s4) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 16 of 17
70. (drive-truck truck7 s4 s5 driver3)
   deleted: (at truck7 s4)
   added: (at truck7 s5)
   changed: (fuel-used) from 15178 to 15438
   goals met: 16 of 17
71. (disembark-truck driver3 truck7 s5)
   deleted: (driving driver3 truck7)
   added: (at driver3 s5) (empty truck7)
   goals met: 17 of 17
